print("------------------\nИгра: Загадай число\n------------------")

num1 = 1
num2 = 100

for t in range(7):
    mid = (num1 + num2) // 2
    print(f"Компьютер: Твоё число равно, меньше или больше, чем {mid}?")
    print("------------------")
    print("1 - Равно, 2 - Больше, 3 - Меньше")
    answer = int(input("Мальчик: "))
    print("------------------")

    if answer == 1:
        print(f"Компьютер: Я угадал! Число равно {mid}.")
        break
    elif answer == 2:
        num1 = mid + 1
    else:
        num2 = mid - 1

if t == 6:
    print("Компьютер: Я не смог угадать число.")